blogDemo/app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "date", "author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "content" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["content", "This is day 2 of my rails blog, i will be adding html content"], ["updated_at", "2019-02-13 15:17:39.266880"], ["id", 2]]